Тест_ЗУП_31_КОРП/src/DataProcessors/АнализНДФЛКВозврату/АнализНДФЛКВозврату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АнализНДФЛКВозврату</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатАнализаПоОрганизации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатыАнализаПоСотрудникам</name>
    <type>
      <types>ValueTree</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Тест_ЗУП_31_КОРП/src/AccumulationRegisters/ВзаиморасчетыССотрудниками/ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <comment>Сумма в валюте взаиморасчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВидВзаиморасчетов</name>
    <type>
      <types>EnumRef.ВидыВзаиморасчетовССотрудниками</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаНачисленияУдержанияВыплаты</name>
    <type>
      <types>EnumRef.ГруппыНачисленияУдержанияВыплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяФинансирования</name>
    <type>
      <types>CatalogRef.СтатьиФинансированияЗарплата</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>CatalogRef.СтатьиРасходовЗарплата</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест_ЗУП_31_КОРП/src/AccumulationRegisters/ЗарплатаКВыплате/ЗарплатаКВыплате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗарплатаКВыплате</name>
  <resources>
    <name>СуммаКВыплате</name>
    <comment>Сумма в валюте взаиморасчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>УдалитьДокументОснование</name>
    <type>
      <types>DocumentRef.ЕдиновременноеПособиеЗаСчетФСС</types>
      <types>DocumentRef.ВозвратНДФЛ</types>
      <types>DocumentRef.ПростойСотрудников</types>
      <types>DocumentRef.Отпуск</types>
      <types>DocumentRef.БольничныйЛист</types>
      <types>DocumentRef.ОплатаПоСреднемуЗаработку</types>
      <types>DocumentRef.Премия</types>
      <types>DocumentRef.ОплатаДнейУходаЗаДетьмиИнвалидами</types>
      <types>DocumentRef.ПерерасчетНДФЛ</types>
      <types>DocumentRef.Увольнение</types>
      <types>DocumentRef.Командировка</types>
      <types>DocumentRef.УвольнениеСписком</types>
      <types>DocumentRef.ОтпускПоУходуЗаРебенком</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяФинансирования</name>
    <type>
      <types>CatalogRef.СтатьиФинансированияЗарплата</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>CatalogRef.СтатьиРасходовЗарплата</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодВзаиморасчетов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ДокументОснованиеЗарплатыКВыплате</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест_ЗУП_31_КОРП/src/AccumulationRegisters/РасчетыНалогоплательщиковСБюджетомПоНДФЛ/РасчетыНалогоплательщиковСБюджетомПоНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыНалогоплательщиковСБюджетомПоНДФЛ</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.ТерриторияВыполненияРаботВОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ДокументыОснованияНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантУдержания</name>
    <type>
      <types>EnumRef.ВариантыУдержанияНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВДекларациюПоНалогуНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетМежрасчетногоПериода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВыплаченногоДохода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПеречисления</name>
    <type>
      <types>EnumRef.СрокиПеречисляемогоНалога</types>
    </type>
  </attributes>
  <attributes>
    <name>КрайнийСрокУплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВыплаченныйДоходВ6НДФЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияДоходаФиксирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстаревшаяДатаПолученияДохода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНалогообложенияРезидента</name>
    <type>
      <types>EnumRef.НДФЛСтавкиНалогообложенияРезидента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцНалоговогоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДохода</name>
    <type>
      <types>EnumRef.КатегорииДоходовНДФЛ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьКодДохода</name>
    <type>
      <types>CatalogRef.УдалитьВидыДоходовНДФЛ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодДохода</name>
    <type>
      <types>CatalogRef.ВидыДоходовНДФЛ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест_ЗУП_31_КОРП/src/DataProcessors/АнализНДФЛКВозврату/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализПоСотрудникам(Команда)
	АнализПоСотрудникамНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Взаиморасчеты.СуммаВзаиморасчетовОстаток, 0) - ЕСТЬNULL(КВыплате.СуммаКВыплатеОстаток, 0) КАК ЗаниженнаяСуммаКВыплате
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками.Остатки(, Организация = &Организация) КАК Взаиморасчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗарплатаКВыплате.Остатки(, Организация = &Организация) КАК КВыплате
	|		ПО Взаиморасчеты.Организация = КВыплате.Организация");
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		ЗаниженнаяСуммаКВыплате = 0;
	Иначе
		ЗаниженнаяСуммаКВыплате = Выборка.ЗаниженнаяСуммаКВыплате;
	КонецЕсли;
	Если ЗаниженнаяСуммаКВыплате = 0 Тогда
		Объект.РезультатАнализаПоОрганизации = НСтр("ru = 'По организации нет заниженных сумм к выплате. Дальнейший анализ не требуется'");
	ИначеЕсли ЗаниженнаяСуммаКВыплате > 0 Тогда
		Объект.РезультатАнализаПоОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'По организации в целом сумма к выплате занижена на %1. Это может быть связано с излишне удержанным НДФЛ. Для более подробного анализа используйте кнопку ""Анализ по сотрудникам""'"),
			Выборка.ЗаниженнаяСуммаКВыплате);
	Иначе
		Объект.РезультатАнализаПоОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'По организации в целом сумма к выплате завышена на %1. Это может быть связано с изменениями, внесенными ""задним числом"" (непоследовательным вводом документов). Для более подробного анализа используйте кнопку ""Анализ по сотрудникам""'"),
			- Выборка.ЗаниженнаяСуммаКВыплате);
	КонецЕсли;
	Объект.РезультатыАнализаПоСотрудникам.ПолучитьЭлементы().Очистить();
	
КонецПроцедуры


&НаСервере
Процедура АнализПоСотрудникамНаСервере()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Взаиморасчеты.ФизическоеЛицо
	|ПОМЕСТИТЬ ВТФизлицаСРазницами
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками.Остатки(, Организация = &Организация) КАК Взаиморасчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗарплатаКВыплате.Остатки(, Организация = &Организация) КАК КВыплате
	|		ПО Взаиморасчеты.ФизическоеЛицо = КВыплате.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Остатки(, Организация = &Организация) КАК НДФЛ
	|		ПО Взаиморасчеты.ФизическоеЛицо = НДФЛ.ФизическоеЛицо
	|ГДЕ
	|	ЕСТЬNULL(Взаиморасчеты.СуммаВзаиморасчетовОстаток, 0) - ЕСТЬNULL(КВыплате.СуммаКВыплатеОстаток, 0) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаиморасчетыССотрудниками.ФизическоеЛицо,
	|	ВзаиморасчетыССотрудниками.Регистратор,
	|	ВзаиморасчетыССотрудниками.Период,
	|	СУММА(ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов) КАК Сумма
	|ПОМЕСТИТЬ ВТВзаиморасчетыССотрудниками
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизлицаСРазницами КАК ФизлицаСРазницами
	|		ПО ВзаиморасчетыССотрудниками.ФизическоеЛицо = ФизлицаСРазницами.ФизическоеЛицо
	|ГДЕ
	|	ВзаиморасчетыССотрудниками.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыССотрудниками.ФизическоеЛицо,
	|	ВзаиморасчетыССотрудниками.Период,
	|	ВзаиморасчетыССотрудниками.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗарплатаКВыплате.ФизическоеЛицо,
	|	ЗарплатаКВыплате.Регистратор,
	|	ЗарплатаКВыплате.Период,
	|	СУММА(ЗарплатаКВыплате.СуммаКВыплате) КАК Сумма
	|ПОМЕСТИТЬ ВТЗарплатаКВыплате
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплате КАК ЗарплатаКВыплате
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизлицаСРазницами КАК ФизлицаСРазницами
	|		ПО ЗарплатаКВыплате.ФизическоеЛицо = ФизлицаСРазницами.ФизическоеЛицо
	|ГДЕ
	|	ЗарплатаКВыплате.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗарплатаКВыплате.ФизическоеЛицо,
	|	ЗарплатаКВыплате.Период,
	|	ЗарплатаКВыплате.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаиморасчетыССотрудниками.ФизическоеЛицо,
	|	ВзаиморасчетыССотрудниками.Регистратор,
	|	ВзаиморасчетыССотрудниками.Период,
	|	ВзаиморасчетыССотрудниками.Сумма
	|ПОМЕСТИТЬ ВТРасхождения
	|ИЗ
	|	ВТВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗарплатаКВыплате.ФизическоеЛицо,
	|	ЗарплатаКВыплате.Регистратор,
	|	ЗарплатаКВыплате.Период,
	|	-ЗарплатаКВыплате.Сумма
	|ИЗ
	|	ВТЗарплатаКВыплате КАК ЗарплатаКВыплате
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расхождения.ФизическоеЛицо КАК Сотрудник,
	|	Расхождения.Регистратор КАК Документ,
	|	СУММА(Расхождения.Сумма) КАК Сумма
	|ИЗ
	|	ВТРасхождения КАК Расхождения
	|
	|СГРУППИРОВАТЬ ПО
	|	Расхождения.ФизическоеЛицо,
	|	Расхождения.Регистратор,
	|	Расхождения.Период
	|
	|ИМЕЮЩИЕ
	|	СУММА(Расхождения.Сумма) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Расхождения.ФизическоеЛицо.Наименование,
	|	Расхождения.Период,
	|	Расхождения.Регистратор
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	Сотрудник");
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	ДеревоРезультата = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДеревоРезультата.Колонки.Добавить("СотрудникДокумент");
	ДеревоРезультата.Колонки.Сумма.Имя = "СуммаКВыплатеЗанижена";
	ДеревоРезультата.Колонки.Добавить("СуммаКВыплатеВозвращена", ДеревоРезультата.Колонки.СуммаКВыплатеЗанижена.ТипЗначения);
	ДеревоРезультата.Колонки.Добавить("ЗаниженаТекст");
	ДеревоРезультата.Колонки.Добавить("ВозвращенаТекст");
	Для Каждого СтрокаСотрудник Из ДеревоРезультата.Строки Цикл
		СтрокаСотрудник.СотрудникДокумент = СтрокаСотрудник.Сотрудник;
		Если СтрокаСотрудник.СуммаКВыплатеЗанижена < 0 Тогда
			СтрокаСотрудник.СуммаКВыплатеВозвращена = - СтрокаСотрудник.СуммаКВыплатеЗанижена;
			СтрокаСотрудник.СуммаКВыплатеЗанижена = 0;
			СтрокаСотрудник.ВозвращенаТекст = НСтр("ru = 'завышена на'");
		Иначе
			СтрокаСотрудник.ЗаниженаТекст = НСтр("ru = 'занижена на'");
		КонецЕсли;
		Для Каждого СтрокаДокумент Из СтрокаСотрудник.Строки Цикл
			СтрокаДокумент.СотрудникДокумент = СтрокаДокумент.Документ;
			Если СтрокаДокумент.СуммаКВыплатеЗанижена < 0 Тогда
				СтрокаДокумент.СуммаКВыплатеВозвращена = - СтрокаДокумент.СуммаКВыплатеЗанижена;
				СтрокаДокумент.СуммаКВыплатеЗанижена = 0;
				СтрокаДокумент.ВозвращенаТекст = НСтр("ru = 'возвращена'");
			Иначе
				СтрокаДокумент.ЗаниженаТекст = НСтр("ru = 'занижена на'");
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	ЗначениеВРеквизитФормы(ДеревоРезультата, "Объект.РезультатыАнализаПоСотрудникам");
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатыАнализаПоСотрудникамВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Родитель = Объект.РезультатыАнализаПоСотрудникам.НайтиПоИдентификатору(ВыбраннаяСтрока).ПолучитьРодителя();
	Если Родитель <> НеОпределено Тогда
		ДокументСсылка = Элемент.ТекущиеДанные.СотрудникДокумент;
		ПоказатьЗначение(, ДокументСсылка);
	Иначе
		ФизлицоСсылка = Элемент.ТекущиеДанные.СотрудникДокумент;
		ПоказатьЗначение(, ФизлицоСсылка);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
